# importando base de dados

In [1]:
import pandas as pd

In [2]:
pd.read_csv('data/tips.csv')

     total_bill   tip dessert   day    time  size
0         16.99  1.01      No   Sun  Dinner     2
1         10.34  1.66      No   Sun  Dinner     3
2         21.01  3.50      No   Sun  Dinner     3
3         23.68  3.31      No   Sun  Dinner     2
4         24.59  3.61      No   Sun  Dinner     4
..          ...   ...     ...   ...     ...   ...
239       29.03  5.92      No   Sat  Dinner     3
240       27.18  2.00     Yes   Sat  Dinner     2
241       22.67  2.00     Yes   Sat  Dinner     2
242       17.82  1.75      No   Sat  Dinner     2
243       18.78  3.00      No  Thur  Dinner     2

[244 rows x 6 columns]

In [3]:
#total_bill: valor total da conta paga pelo cliente
#tip: valor da gorjeta em si
#dessert: se a pessoa pediu sobremesa ou não
#day: dia da semana
#time: horário de almoço ou horário de jantar
#size: quantidade de clientes na mesa

In [4]:
data = pd.read_csv('data/tips.csv') #armazeno na variavel data

In [5]:
data

     total_bill   tip dessert   day    time  size
0         16.99  1.01      No   Sun  Dinner     2
1         10.34  1.66      No   Sun  Dinner     3
2         21.01  3.50      No   Sun  Dinner     3
3         23.68  3.31      No   Sun  Dinner     2
4         24.59  3.61      No   Sun  Dinner     4
..          ...   ...     ...   ...     ...   ...
239       29.03  5.92      No   Sat  Dinner     3
240       27.18  2.00     Yes   Sat  Dinner     2
241       22.67  2.00     Yes   Sat  Dinner     2
242       17.82  1.75      No   Sat  Dinner     2
243       18.78  3.00      No  Thur  Dinner     2

[244 rows x 6 columns]

In [6]:
data.head()

   total_bill   tip dessert  day    time  size
0       16.99  1.01      No  Sun  Dinner     2
1       10.34  1.66      No  Sun  Dinner     3
2       21.01  3.50      No  Sun  Dinner     3
3       23.68  3.31      No  Sun  Dinner     2
4       24.59  3.61      No  Sun  Dinner     4

## Renomeando as colunas

# Tradução

In [8]:
data.columns

Index(['total_bill', 'tip', 'dessert', 'day', 'time', 'size'], dtype='object')

In [9]:
rename = {
    'total_bill' : 'valor_da_conta',
    'tip' : 'gorjeta',
    'dessert' : 'sobremesa',
    'day' : 'dia_da_semana',
    'time' : 'hora_do_dia', 
    'size' : 'total_de_pessoas'
}

In [13]:
type(data)

pandas.core.frame.DataFrame

In [14]:
gorjetas = data.rename(columns = rename)

In [15]:
gorjetas.head(1)

,valor_da_conta,gorjeta,sobremesa,dia_da_semana,hora_do_dia,total_de_pessoas
0,16.99,1.01,No,Sun,Dinner,2

In [16]:
gorjetas.sobremesa.unique() #traz todos os valores que tem em sobremesa

array(['No', 'Yes'], dtype=object)

In [17]:
yes_no = {
    'No' : 'Não', 
    'Yes' : 'Sim'
}

In [19]:
gorjetas.sobremesa.map(yes_no)

0      Não
1      Não
2      Não
3      Não
4      Não
      ...
239    Não
240    Sim
241    Sim
242    Não
243    Não
Name: sobremesa, Length: 244, dtype: object

In [20]:
gorjetas.head(1)

,valor_da_conta,gorjeta,sobremesa,dia_da_semana,hora_do_dia,total_de_pessoas
0,16.99,1.01,No,Sun,Dinner,2

In [21]:
gorjetas.sobremesa = gorjetas.sobremesa.map(yes_no)

In [22]:
gorjetas.head(1)

,valor_da_conta,gorjeta,sobremesa,dia_da_semana,hora_do_dia,total_de_pessoas
0,16.99,1.01,Não,Sun,Dinner,2

In [23]:
gorjetas.dia_da_semana.unique()

array(['Sun', 'Sat', 'Thur', 'Fri'], dtype=object)

In [24]:
days = {
    'Sun' : 'Domingo',
    'Sat' : 'Sábado',
    'Thur' : 'Quinta',
    'Fri' : 'Sexta'
}

In [25]:
gorjetas.dia_da_semana = gorjetas.dia_da_semana.map(days)

In [26]:
gorjetas.head(1)

,valor_da_conta,gorjeta,sobremesa,dia_da_semana,hora_do_dia,total_de_pessoas
0,16.99,1.01,Não,Domingo,Dinner,2

In [28]:
gorjetas.dia_da_semana.unique()

array(['Domingo', 'Sábado', 'Quinta', 'Sexta'], dtype=object)

In [29]:
gorjetas.hora_do_dia.unique()

array(['Dinner', 'Lunch'], dtype=object)

In [30]:
time = {
    'Dinner' : 'Jantar',
    'Lunch' : 'Almoço'
}

In [31]:
gorjetas.hora_do_dia = gorjetas.hora_do_dia.map(time)

In [32]:
gorjetas.head(1)

,valor_da_conta,gorjeta,sobremesa,dia_da_semana,hora_do_dia,total_de_pessoas
0,16.99,1.01,Não,Domingo,Jantar,2

In [33]:
#Exibir as 5 ultimas linhas do DataFrame:

#gorjetas.tail()

#Listar as colunas presentes no DataFrame:

#gorjetas.columns

#Exibir a quantidade de linhas e colunas presentes no DataFrame:

#gorjetas.shape

#Deletar uma coluna do DataFrame:

#gorjetas.drop('day', axis=1)